### 1 - Crie um DataFrame com as colunas nome, idade, altura, peso e sexo usando listas.

In [98]:
import pandas as pd
import numpy as np
import pandas as pd
from faker import Faker

In [99]:
data = {
    'nome': ['Ana', 'Bruno', 'Carla', 'Daniel', 'Eduarda', 'Felipe', 'Gabriela', 'Henrique'],
    'idade': [23, 45, 25, 36, 29, 41, 30, 36],
    'cidade': ['São Paulo', 'Rio de Janeiro', 'São Paulo', 'Rio de Janeiro', np.nan, 'São Paulo', 'Salvador', 'São Paulo'],
    'salario': [3000, 5000, 4500, np.nan, 3800, 5200, np.nan, 4800],
    'categoria': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'altura': [1.75, 1.85, 1.65, 1.70, 1.60, 1.55, 1.99, 1.87],
    'peso': [80, 85, 75, 68, 90, 87, 56, 75],
    'sexo': ["F", "M", "F", "M", "F", "M", "F", "M"]
}

### 2 - Exiba o DataFrame criado.

In [100]:
df = pd.DataFrame(data)
print(df)

       nome  idade          cidade  salario categoria  altura  peso sexo
0       Ana     23       São Paulo   3000.0         A    1.75    80    F
1     Bruno     45  Rio de Janeiro   5000.0         B    1.85    85    M
2     Carla     25       São Paulo   4500.0         A    1.65    75    F
3    Daniel     36  Rio de Janeiro      NaN         B    1.70    68    M
4   Eduarda     29             NaN   3800.0         A    1.60    90    F
5    Felipe     41       São Paulo   5200.0         B    1.55    87    M
6  Gabriela     30        Salvador      NaN         A    1.99    56    F
7  Henrique     36       São Paulo   4800.0         B    1.87    75    M

### 3 - Selecione e exiba a coluna "idade" do DataFrame.

In [101]:
idade = df.iloc[:, 1]
print(idade)

0    23
1    45
2    25
3    36
4    29
5    41
6    30
7    36
Name: idade, dtype: int64

### 4 - Selecione e exiba a linha com índice 2 do DataFrame.

In [102]:
linha_2 = df.iloc[2]

print(linha_2)

nome             Carla
idade               25
cidade       São Paulo
salario         4500.0
categoria            A
altura            1.65
peso                75
sexo                 F
Name: 2, dtype: object

### 5 - Selecione e exiba a linha com rótulo 2 do DataFrame.

In [103]:
df = pd.DataFrame(data, index=['pessoa1','pessoa2', 'pessoa3', 'pessoa4', 'pessoa5', 'pessoa6', 'pessoa7', 'pessoa8'])

In [104]:
df.iloc[2]

nome             Carla
idade               25
cidade       São Paulo
salario         4500.0
categoria            A
altura            1.65
peso                75
sexo                 F
Name: pessoa3, dtype: object

In [105]:
df.loc['pessoa3']

nome             Carla
idade               25
cidade       São Paulo
salario         4500.0
categoria            A
altura            1.65
peso                75
sexo                 F
Name: pessoa3, dtype: object

### 6 - Selecione e exiba o valor da célula na linha de rótulo 3, coluna "altura".

In [106]:
df.loc['pessoa3', 'altura']

np.float64(1.65)

### 7 - Renomeie as colunas "sexo" para "genero" e "peso" para "massa".

In [107]:
df = df.rename(columns={'sexo': 'genero'})

In [108]:
df = df.rename(columns={'peso': 'massa'} )

In [78]:
print(df)

             nome  idade          cidade  salario categoria  altura  massa  \
pessoa1       Ana     23       São Paulo   3000.0         A    1.75     80
pessoa2     Bruno     45  Rio de Janeiro   5000.0         B    1.85     85
pessoa3     Carla     25       São Paulo   4500.0         A    1.65     75
pessoa4    Daniel     36  Rio de Janeiro      NaN         B    1.70     68
pessoa5   Eduarda     29             NaN   3800.0         A    1.60     90
pessoa6    Felipe     41       São Paulo   5200.0         B    1.55     87
pessoa7  Gabriela     30        Salvador      NaN         A    1.99     56
pessoa8  Henrique     36       São Paulo   4800.0         B    1.87     75

        genero
pessoa1      F
pessoa2      M
pessoa3      F
pessoa4      M
pessoa5      F
pessoa6      M
pessoa7      F
pessoa8      M

### 8 - Selecione e exiba as colunas "nome" e "altura" do DataFrame.

In [109]:
df_selecionado = df[['nome', 'altura']]
print(df_selecionado)

             nome  altura
pessoa1       Ana    1.75
pessoa2     Bruno    1.85
pessoa3     Carla    1.65
pessoa4    Daniel    1.70
pessoa5   Eduarda    1.60
pessoa6    Felipe    1.55
pessoa7  Gabriela    1.99
pessoa8  Henrique    1.87

### 9 - Filtre e exiba todas as linhas onde a idade é maior que 40.

In [110]:
df_filtra = df[df['idade'] > 40]
print(df_filtra)

           nome  idade          cidade  salario categoria  altura  massa  \
pessoa2   Bruno     45  Rio de Janeiro   5000.0         B    1.85     85
pessoa6  Felipe     41       São Paulo   5200.0         B    1.55     87

        genero
pessoa2      M
pessoa6      M

### 10 - Adicione uma nova coluna chamada "IMC" ao DataFrame, calculando o Índice de Massa Corporal.

In [111]:
df['IMC'] = df['massa'] / (df['altura'] ** 2)
df['IMC'] = df['IMC'].round(2) # Colocando com 2 casa decimal
print(df)

             nome  idade          cidade  salario categoria  altura  massa  \
pessoa1       Ana     23       São Paulo   3000.0         A    1.75     80
pessoa2     Bruno     45  Rio de Janeiro   5000.0         B    1.85     85
pessoa3     Carla     25       São Paulo   4500.0         A    1.65     75
pessoa4    Daniel     36  Rio de Janeiro      NaN         B    1.70     68
pessoa5   Eduarda     29             NaN   3800.0         A    1.60     90
pessoa6    Felipe     41       São Paulo   5200.0         B    1.55     87
pessoa7  Gabriela     30        Salvador      NaN         A    1.99     56
pessoa8  Henrique     36       São Paulo   4800.0         B    1.87     75

        genero    IMC
pessoa1      F  26.12
pessoa2      M  24.84
pessoa3      F  27.55
pessoa4      M  23.53
pessoa5      F  35.16
pessoa6      M  36.21
pessoa7      F  14.14
pessoa8      M  21.45

### 11 - Ordene o DataFrame pela coluna "altura" em ordem crescente.

In [112]:
df_ordenado = df.sort_values(by='altura') # Colocar em ordem Crescente aparti da altura.
print(df_ordenado)

             nome  idade          cidade  salario categoria  altura  massa  \
pessoa6    Felipe     41       São Paulo   5200.0         B    1.55     87
pessoa5   Eduarda     29             NaN   3800.0         A    1.60     90
pessoa3     Carla     25       São Paulo   4500.0         A    1.65     75
pessoa4    Daniel     36  Rio de Janeiro      NaN         B    1.70     68
pessoa1       Ana     23       São Paulo   3000.0         A    1.75     80
pessoa2     Bruno     45  Rio de Janeiro   5000.0         B    1.85     85
pessoa8  Henrique     36       São Paulo   4800.0         B    1.87     75
pessoa7  Gabriela     30        Salvador      NaN         A    1.99     56

        genero    IMC
pessoa6      M  36.21
pessoa5      F  35.16
pessoa3      F  27.55
pessoa4      M  23.53
pessoa1      F  26.12
pessoa2      M  24.84
pessoa8      M  21.45
pessoa7      F  14.14

### 12 - Filtre e exiba todas as linhas onde a altura é  maior que 1.65.

In [113]:
# Sem o filtro
print(df)

             nome  idade          cidade  salario categoria  altura  massa  \
pessoa1       Ana     23       São Paulo   3000.0         A    1.75     80
pessoa2     Bruno     45  Rio de Janeiro   5000.0         B    1.85     85
pessoa3     Carla     25       São Paulo   4500.0         A    1.65     75
pessoa4    Daniel     36  Rio de Janeiro      NaN         B    1.70     68
pessoa5   Eduarda     29             NaN   3800.0         A    1.60     90
pessoa6    Felipe     41       São Paulo   5200.0         B    1.55     87
pessoa7  Gabriela     30        Salvador      NaN         A    1.99     56
pessoa8  Henrique     36       São Paulo   4800.0         B    1.87     75

        genero    IMC
pessoa1      F  26.12
pessoa2      M  24.84
pessoa3      F  27.55
pessoa4      M  23.53
pessoa5      F  35.16
pessoa6      M  36.21
pessoa7      F  14.14
pessoa8      M  21.45

In [114]:
# Com o Filtro
df_altura = df[df['altura'] > 1.65]
print(df_altura)

             nome  idade          cidade  salario categoria  altura  massa  \
pessoa1       Ana     23       São Paulo   3000.0         A    1.75     80
pessoa2     Bruno     45  Rio de Janeiro   5000.0         B    1.85     85
pessoa4    Daniel     36  Rio de Janeiro      NaN         B    1.70     68
pessoa7  Gabriela     30        Salvador      NaN         A    1.99     56
pessoa8  Henrique     36       São Paulo   4800.0         B    1.87     75

        genero    IMC
pessoa1      F  26.12
pessoa2      M  24.84
pessoa4      M  23.53
pessoa7      F  14.14
pessoa8      M  21.45

### 13 - Modifique a altura de alguém para 1.91 e exiba o DataFrame.

In [115]:
df.loc['pessoa3', 'altura' ] = 1.91
print(df)

             nome  idade          cidade  salario categoria  altura  massa  \
pessoa1       Ana     23       São Paulo   3000.0         A    1.75     80
pessoa2     Bruno     45  Rio de Janeiro   5000.0         B    1.85     85
pessoa3     Carla     25       São Paulo   4500.0         A    1.91     75
pessoa4    Daniel     36  Rio de Janeiro      NaN         B    1.70     68
pessoa5   Eduarda     29             NaN   3800.0         A    1.60     90
pessoa6    Felipe     41       São Paulo   5200.0         B    1.55     87
pessoa7  Gabriela     30        Salvador      NaN         A    1.99     56
pessoa8  Henrique     36       São Paulo   4800.0         B    1.87     75

        genero    IMC
pessoa1      F  26.12
pessoa2      M  24.84
pessoa3      F  27.55
pessoa4      M  23.53
pessoa5      F  35.16
pessoa6      M  36.21
pessoa7      F  14.14
pessoa8      M  21.45

In [86]:
df_altura = df[df['altura'] > 1.65]
print(df_altura)

             nome  idade          cidade  salario categoria  altura  massa  \
pessoa1       Ana     23       São Paulo   3000.0         A    1.75     80
pessoa2     Bruno     45  Rio de Janeiro   5000.0         B    1.85     85
pessoa3     Carla     25       São Paulo   4500.0         A    1.91     75
pessoa4    Daniel     36  Rio de Janeiro      NaN         B    1.70     68
pessoa7  Gabriela     30        Salvador      NaN         A    1.99     56
pessoa8  Henrique     36       São Paulo   4800.0         B    1.87     75

        genero    IMC
pessoa1      F  26.12
pessoa2      M  24.84
pessoa3      F  27.55
pessoa4      M  23.53
pessoa7      F  14.14
pessoa8      M  21.45

### 14 - Crie uma coluna com valores de CPF para cada linha

In [123]:
def gerar_cpf():
    fake = Faker('pt_BR')  # Specify 'pt_BR' locale for Brazilian data
    return fake.cpf()

def validate_cpf(cpf):
    # Implement CPF validation logic here (optional)
    return True  # Placeholder for validation

def generate_cpf_column(df):
    # Consider using vectorized operations for performance
    df['CPF'] = [gerar_cpf() for _ in range(len(df))]
    df['CPF_valid'] = df['CPF'].apply(validate_cpf)  # Add validation (optional)
    return df

# Replace 'your_data' with your actual data
data = {
    'nome': ['Ana', 'Bruno', 'Carla', 'Daniel', 'Eduarda', 'Felipe', 'Gabriela', 'Henrique'],
    'idade': [23, 45, 25, 36, 29, 41, 30, 36],
    'cidade': ['São Paulo', 'Rio de Janeiro', 'São Paulo', 'Rio de Janeiro', np.nan, 'São Paulo', 'Salvador', 'São Paulo'],
    'salario': [3000, 5000, 4500, np.nan, 3800, 5200, np.nan, 4800],
    'categoria': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'altura': [1.75, 1.85, 1.65, 1.70, 1.60, 1.55, 1.99, 1.87],
    'peso': [80, 85, 75, 68, 90, 87, 56, 75],
    'sexo': ["F", "M", "F", "M", "F", "M", "F", "M"]
}
df = pd.DataFrame(data)

df = generate_cpf_column(df)
print(df)

       nome  idade          cidade  salario categoria  altura  peso sexo  \
0       Ana     23       São Paulo   3000.0         A    1.75    80    F
1     Bruno     45  Rio de Janeiro   5000.0         B    1.85    85    M
2     Carla     25       São Paulo   4500.0         A    1.65    75    F
3    Daniel     36  Rio de Janeiro      NaN         B    1.70    68    M
4   Eduarda     29             NaN   3800.0         A    1.60    90    F
5    Felipe     41       São Paulo   5200.0         B    1.55    87    M
6  Gabriela     30        Salvador      NaN         A    1.99    56    F
7  Henrique     36       São Paulo   4800.0         B    1.87    75    M

              CPF  CPF_valid
0  852.093.176-68       True
1  065.241.387-08       True
2  145.786.039-20       True
3  509.263.187-21       True
4  851.463.792-46       True
5  209.385.764-29       True
6  913.547.680-00       True
7  417.386.205-90       True

In [124]:
df

,nome,idade,cidade,salario,categoria,altura,peso,sexo,CPF,CPF_valid
0,Ana,23,São Paulo,3000.0,A,1.75,80,F,852.093.176-68,True
1,Bruno,45,Rio de Janeiro,5000.0,B,1.85,85,M,065.241.387-08,True
2,Carla,25,São Paulo,4500.0,A,1.65,75,F,145.786.039-20,True
3,Daniel,36,Rio de Janeiro,NaN,B,1.70,68,M,509.263.187-21,True
4,Eduarda,29,NaN,3800.0,A,1.60,90,F,851.463.792-46,True
5,Felipe,41,São Paulo,5200.0,B,1.55,87,M,209.385.764-29,True
6,Gabriela,30,Salvador,NaN,A,1.99,56,F,913.547.680-00,True
7,Henrique,36,São Paulo,4800.0,B,1.87,75,M,417.386.205-90,True

### 15 - Exclua a coluna CPF do DataFrame.

In [125]:
df = df.drop(columns=['CPF', 'CPF_valid' ])
df

       nome  idade          cidade  salario categoria  altura  peso sexo
0       Ana     23       São Paulo   3000.0         A    1.75    80    F
1     Bruno     45  Rio de Janeiro   5000.0         B    1.85    85    M
2     Carla     25       São Paulo   4500.0         A    1.65    75    F
3    Daniel     36  Rio de Janeiro      NaN         B    1.70    68    M
4   Eduarda     29             NaN   3800.0         A    1.60    90    F
5    Felipe     41       São Paulo   5200.0         B    1.55    87    M
6  Gabriela     30        Salvador      NaN         A    1.99    56    F
7  Henrique     36       São Paulo   4800.0         B    1.87    75    M

### 16 - Resete o índice do DataFrame e exiba o resultado.

In [128]:
df

df = df.reset_index(drop=True)

In [129]:
df

       nome  idade          cidade  salario categoria  altura  peso sexo
0       Ana     23       São Paulo   3000.0         A    1.75    80    F
1     Bruno     45  Rio de Janeiro   5000.0         B    1.85    85    M
2     Carla     25       São Paulo   4500.0         A    1.65    75    F
3    Daniel     36  Rio de Janeiro      NaN         B    1.70    68    M
4   Eduarda     29             NaN   3800.0         A    1.60    90    F
5    Felipe     41       São Paulo   5200.0         B    1.55    87    M
6  Gabriela     30        Salvador      NaN         A    1.99    56    F
7  Henrique     36       São Paulo   4800.0         B    1.87    75    M

### 17 - Exiba as linhas do DataFrame onde a altura é maior que 1.70.

In [130]:
df_altura = df[df['altura'] > 1.70]
print(df_altura)

       nome  idade          cidade  salario categoria  altura  peso sexo
0       Ana     23       São Paulo   3000.0         A    1.75    80    F
1     Bruno     45  Rio de Janeiro   5000.0         B    1.85    85    M
6  Gabriela     30        Salvador      NaN         A    1.99    56    F
7  Henrique     36       São Paulo   4800.0         B    1.87    75    M

### 18 - Selecione e exiba as colunas "nome" e "genero".

In [132]:

df = df.rename(columns={'sexo': 'genero'})

df_selecionado = df[['nome', 'genero']]
print(df_selecionado)

       nome genero
0       Ana      F
1     Bruno      M
2     Carla      F
3    Daniel      M
4   Eduarda      F
5    Felipe      M
6  Gabriela      F
7  Henrique      M

In [133]:
df

       nome  idade          cidade  salario categoria  altura  peso genero
0       Ana     23       São Paulo   3000.0         A    1.75    80      F
1     Bruno     45  Rio de Janeiro   5000.0         B    1.85    85      M
2     Carla     25       São Paulo   4500.0         A    1.65    75      F
3    Daniel     36  Rio de Janeiro      NaN         B    1.70    68      M
4   Eduarda     29             NaN   3800.0         A    1.60    90      F
5    Felipe     41       São Paulo   5200.0         B    1.55    87      M
6  Gabriela     30        Salvador      NaN         A    1.99    56      F
7  Henrique     36       São Paulo   4800.0         B    1.87    75      M

### 19 - Calcule e exiba a soma das idades.

In [134]:
soma_idades = df['idade'].sum()

# Exibindo o resultado
print("A soma das idades é:", soma_idades)

A soma das idades é: 265


### 20 - Salve o DataFrame em um arquivo CSV.

In [136]:
df.to_csv('Exercício 03 - Pandas.csv', index=False)